Autodesk.Revit.DB.Macros.ModuleSettings.Description
The module description.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Macros.ModuleSettings.Name
The module name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Macros.ModuleSettings.#ctor(System.String,Autodesk.Revit.DB.Macros.MacroLanguageType)
Constructs a new module settings.
name:
The module name.
macroLanguageType:
The Macro language type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014